//! sort - porametr

// Во всех задачах используйте только методы map, filter.

// 1. Вам дан массив: [315, 64, 75, 43, 65, 63].Найдите сумму каждого числа.

// let arr =  [315, 64, 75, 43, 65, 63]
// arr = arr.map  (el=>{
//     return el + el
// })
//  console.log(arr);

// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, изменяющую букву а в каждом имени на я и выведите в консоль.

// const task2 = ["Аскар", "Баяман", "Калмамат"];
// arr = arr.repleisALL("a", "я");
// console.log(arr.repleisALL);
// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат']. Создайте функцию, которая выводит только те имена, где есть буква к и выведите в консоль.
// 4. Вам дан массив: [4, 54, 49]. Сделайте из него массив, состоящий из квадратов этих чисел.

// let arr = [4, 54, 49];
// arr = arr.map((el) => {
//   return el ** 2;
// });
// console.log(arr);

// 5. Вам дан массив [3134, 4, -143, -245, -214]. Оставьте в нем только отрицательные числа.
// functiontask5

// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте в нем только четные числа.
// let task3 = function ( arr) {
//     return arr.filter ((el) =>{
//         return
//     } )
// }
// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
// const task8 = (arr) =>
// 8. Вам дан массив [-13, 96, -41, -28, 40]. Посчитайте количество отрицательных чисел в этом массиве.
// const task9 = ( arr) => {
//     return arr.filter  ( el =>{

//     })
// }
// 9. Вам дан массив [3, 51, -30, -54, 60]. Оставьте в нем только положительные числа. Затем извлеките квадратный корень из этих чисел, если эти числа больше 30.
// const task0 = (arr ) => {
//     return arr.filter (el => {
//         return el
//     })
// }
// 10. Вам дан массив [55, 44, 55, 44, 15, 49]. Оставьте в нем только н  еповторяющиеся числа.
// const task4 = (arr) => {
//   return arr.filter((el) => {
//     return arr.indexOf(el) === arr.lastindexOf(el);
//   });
// };
// console.log([55, 44, 55, 44, 15, 49]);
// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null]. Создайте функцию, которая очищает массив от ложных (false) значений: false, null, undefined, 0, –0, NaN и "" (пустая строка).

// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Выведите длину каждой строки.
// let arr = ["Бегимай", "Баяман", "Калмамат"];
// console.log(arr.length);
