// Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
//let nun = 5;
//console.log;(nun)
//Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
//let a = 10;
//let b = 2;
//let c = 5;
//console.log(a + b + c);
// Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
//let a = 100;
//let c = 2;
//console.log(100 * 2);
// Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
//let a = 67;
//let b = 7;
//console.log(67 & 7);
// Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
//let a = 10;
//let b = 2;
//console.log(10 + 2);
//console.log(10 - 2);
//console.log(10 * 2);
//console.log(10 / 2);
//console.log(10 % 2);
// Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let c = 15;
// let d = 2;

// Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
//let a = 30;
//let b = 15;
//let c = 4;
//console.log(30 + 15 & 4);
// Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.
//let a = 17;
//let b = 10;
//let c = 7;
//let d = 40;
//console.log(17 - 10 + 40);

// Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль.
// let a = "10";
// let b = "99";
// console.log(result + 99);
// Вам даны переменные name='Аскар', number=10. Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.
// let a ='askar';
// let b = 10;
// console.log("askar" + 10);

//  Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной в консоль.
// let str = "Привет, Мир!";
// console.log(str);
//  Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите в консоль фразу 'Привет, Мир!'.
// let str1='Привет '
// let str2='Мир '
// console.log(str1 + str2);
//  Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.
// let a = {
//     name="Kutman"
// }
// console.log(`Привет,`);
//  Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.

//  Вам даны четыре переменные.
// Первая - для хранения количества дней. Присвойте ей значение "365".
// let a = "365"
// Вторая - для хранения названия нашей планеты "Земля".
// let b = "Земля"
// Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
// let c = "7 млрд."
// Четвертая - для хранения слова "Солнце".
// let d ="Солнце"
// Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
// let a = "365"
// let b = "Земля"
// let c = "7млрд."
// let d ="Солнце"
// console.log(a + b + c + d);
// "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет примерно 7 млрд. человек."
// let a = "365"
// let b = "Земля"
// let c = "7млрд."
// let d ="Солнце"
// console.log(// "В нашем году & {a} дней. Днём у нас светит&{d}. Население планеты &{b} составляет примерно &{c}. человек.");

//! Переменный
//!1 var
//!2 let
//!3 const

//? camelСase
// let motionWebAcademy = "";
//? snake_case
// let motion_web_academy = ""

// let str = "hello world"
// str = "js"
// console.log(str);
// const str = "hello world";
// str = "js";
// console.log(str);

// console.log(name);
// var name ="js30";
// console.log(a);
// let a = "hello world";
// console.log(a);
// const a = "hello world";
// data types 8 - тип данных
// number - 1234567890, 34.2, 1.3
// string - "frgthy 3456 & ,. ", 'edrfg345',  fghn4556
// boolean - true,false
// null - null
// undefined - белгисиз нерсе
// bigint - 1n - чон сандар
// symbol - Symbol("hello world")
// object - {}
// typeof
// console.log(typeof 1234); // number
// console.log(typeof "sdfgh 2345    "); // string
// console.log(typeof true); // boolean
// console.log(typeof null); // object
// console.log(typeof undefined); // undefined
// console.log(typeof 34567n); // bigint
// console.log(typeof Symbol()); // symbol
// console.log(typeof {}); // object
// let a = false
// console.log(typeof a);
// +
// console.log(12345 + 4532);
// -
// console.log(5 - 5);
// *
// console.log(5 * 5);
// /
// console.log(5 / 5);
// **
// console.log(5 ** 3);
// %
// console.log(200 % 15);
// NaN - not a number - не чиcло - invalid number - typof = number
// oparator - терминдер - Бинарный, Унарный, операнд
// console.log(null + undefined);
// alert();
// prompt();
// confirm();
// let a = prompt("your name?");
// console.log(a);
// let a = confirm("вам есть 18?");
// console.log(a);
// 1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// let num = 5;
// console.log(num);
// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a = 10
// let b = 2
// let c = 5
// console.log(a + b + c);
// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let num = 50
// console.log(num * 2);
// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// let num = 67
// console.log(num % 7);
// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// let a = 10;
// let b = 2;
// console.log(a + b);
// console.log(a - b);
// console.log(a * b);
// console.log(a / b);
// console.log(a % b);
// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат
// присвойте переменной result. Выведите в консоль значение переменной result.
// let c = 15;
// let d = 2;
// let result = c + d;
// console.log(result);
// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и
// результат присвойте переменной c. Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30
// let b = 15
// let c = a + b
// console.log(c % 4);
// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и
// результат присвойте переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d,
// а результат запишите в переменную result. Выведите в консоль значение переменной result.
// let a = 17
// let b = 10
// let c = a - b
// let d = 15
// let result = c + d
// console.log(result);

// 9. Вам даны a='10' и b='99'. Сложите переменные a и b и присвойте результат переменной result и выведите её в консоль.
// let a = "10";
// let b = "99";
// let result = a + b;
// console.log(result);
// 10. Вам даны переменные name='Аскар', number=10. Сложите данные переменные, присвойте результат переменной result и выведите её в консоль.
// let name = 'Аскар'
// let number = 10
// console.log(name + number);
//! Number Method - Методы
// floor() - 1.1, 1.9 = 1
// console.log(Math.floor(1.2));
// ceil() - 1.1, 1.9 = 2
// console.log(Math.ceil(1.9));
// round() - 1.1 = 1, 1.9 = 2
// console.log(Math.round(1.6));
// abs() - -12345 = 12345
// console.log(Math.abs(1.1234));
// pow() - power - **
// console.log(Math.pow());
// random() - 0,1 random
// console.log(Math.random());

// sqrt()
// console.log(Math.sqrt(64));
// trunc() -1.234567 = 1
// console.log(Math.trunc(234.234567898765432));
//! ОПЕРАТОР

//? Терминдер: "Унарный", "Бинарный",  "Операнд",

//! Операнд - Бул операторго тиешелуу болгон же колдонулган нерселерди айтабыз,
// жана аларды "Аргументтер" деп дагы аташат

//? Мисалдар:
// let user = 30 - 6; - Число 30 жана 6 - бул операндалар, анткени алар минус операторуна колдонулуп атат.
// либо - же болбосо
// let user = h + y; - Перменныйлар h жана y - бул операндалар
//! Бинарный деп биз эки операндага тиешелуу операндаларды айтабыз,
// Биздин мисалда, алып салуу жана кошуу бинарный оператор.

// let user = 30 % 6;
// console.log(user);

//! Унарный деп биз бир гана операндага тиешелуу болгон операторду атайбыз.
// МИСАЛЫ:

// let user = -30;
// console.log(user);
//////////////////////////////////////

// Математикалык опараторлор:
// + = кошуу
// - = Алып салуу
// * = кобойтуу
// / = Болуп салуу
// % = Болуунун калган болугун алуу
// ** = Даражага которот, озуно озу кобойтот

//! Операторлордун мумкунчулуктору

//? Кошуу операторун саптарга колдонуу
// let resultOne = "JavaScript" + " HTML " + "CSS";
// console.log(resultOne);
//

// let resultTwo = "JavaScript " + 58;
// console.log(resultTwo);
// console.log(typeof resultTwo);

// let resultThree = 58 + " JavaScript";
// console.log(resultThree);

// let resultFour = 2 + "2";
// console.log(resultFour);

//Сап кошууга чейинки операциялар
//адаттагыдай эле аткарылат
// let resultFive = 25 - 20 + " Дастан";
// console.log(resultFive);

// Башка операторлордун иштеши
// let resultOne = "25" - 5;
// console.log(resultOne);
// console.log(typeof resultOne);

// //же
// //
// let resultTwo = 10 * "sdfghb";
// console.log(resultTwo);
// console.log(typeof resultOne);

// // //Жараксыз иш
// let resultThree = 3 * "JavaScript";
// console.log(resultThree); //Кайра  NaN келет
// console.log(typeof resultOne);

// Бирдиктүү(Унарный) оператор +

//Саптар менен
// let resultOne = +"25";
// console.log(resultOne);
// console.log(typeof resultOne);
//
// Сандар менен
// let resultTwo = +10;
// console.log(resultTwo);
// console.log(typeof resultTwo);

//Мисал
// let users = "25";
// let admins = "10";
// console.log(users + admins);
// console.log(+users + +admins);

//Узун жазуу
// console.log(Number(users) + Number(admins));

//Операторлордун артыкчылыгы
//Ар кандай артыкчылык
// let resultOne = 2 - 1 * 5;
// console.log(resultOne);
// let resultTwo = (2 - 1) * 5;
// console.log(resultTwo);
// Окшош эле артыкчылык
// let resultThree = 2 - 1 + 5;
// console.log(resultThree);

//! String - строка - сап >>> "", '', ``
// let age = 24;
// let name = "js"
// console.log(my names is ${name}, my age is ${age});
// console.log(str.length);
// console.log(str[]);
// length - узундугун чыгарып берет - элементтердин санын - узундугу
// index[] - 0,1,2 .......

// let str = "Bishkek";
// console.log(str[str.length - 1]);
// console.log(str[Math.floor(str.length / 2)]);
//! toUpperCase()
// console.log(str.toUpperCase());
//! toLowerCase()
// console.log(str.toLowerCase());
//! includes()
// console.log(str.includes("p"));
//! indexOf()
// console.log(str.indexOf("p"));
// ! lastIndexOf()
// console.log(str.lastIndexOf("w"));
// ! repeat()
// console.log(str.repeat(10));





// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной в консоль.
// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0, а переменная b больше или равна 5, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти, или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.
// 14. Вам дана переменная age=*любое двузначное число*. Составьте условие, по которому, в консоль будет выводиться "Мне  год", "Мне  лет", в зависимости от возраста. Наример мне 21 год, мне 20 лет.
// 15. Вам дана переменная time= *любое чило от 1 до 59*. Составьте условие, по которому время будет делиться на четверти. Пример: time = 12 - Первая четверть. Если число больше 60, то в консоли будет выдаваться "Неверное число".